app/controllers/fax_documents_controller.rb

SELECT * FROM "fax_documents"
---
  def index
  	@faxes = current_user.is_admin? ? FaxDocument.all : FaxDocument.public

SELECT * FROM "fax_documents" WHERE ("fax_documents"."id" = 2)
---
  def show
  	@fax = FaxDocument.find(params[:id])

SELECT * FROM "fax_documents" WHERE ("fax_documents"."id" = 2)
UPDATE "fax_documents" SET "updated_at" = '2009-11-02 20:35:29', "private" = 'f' WHERE "id" = 2
SELECT * FROM "fax_documents"
---
	def make_public
		@fax = FaxDocument.find(params[:id])
		@fax.private = false
		@fax.save!

		render :update do |page|
			page.replace_html 'faxes', :partial => 'faxes', :object => FaxDocument.all

SELECT * FROM "fax_documents" WHERE ("fax_documents"."id" = 2)
UPDATE "fax_documents" SET "updated_at" = '2009-11-02 20:34:29', "private" = 't' WHERE "id" = 2
SELECT * FROM "fax_documents"
---
	def make_private
		@fax = FaxDocument.find(params[:id])
		@fax.private = true
		@fax.save!

		render :update do |page|
			page.replace_html 'faxes', :partial => 'faxes', :object => FaxDocument.all

SELECT * FROM "fax_documents"
---
	def update_faxes
		FaxDocument.update_fax_documents
		render :update do |page|
			page.replace_html 'faxes', :partial => 'faxes', :object => FaxDocument.all